PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
#include "wifi_manager.h"
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_mac.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include <inttypes.h>
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "esp_timer.h"

#define TAG "WIFI_MGR"

#define WIFI_CONNECTED_BIT BIT0
#define WIFI_DISCONNECTED_BIT BIT1
#define WIFI_AP_STARTED_BIT BIT2
#define WIFI_SCAN_DONE_BIT BIT3
#define WIFI_CONNECT_FAIL_BIT BIT4

#define MAX_RECONNECT_ATTEMPTS 5
#define WIFI_CONNECT_TIMEOUT_MS 45000
#define RECONNECT_DELAY_MS 5000
#define DEFAULT_AP_IP "192.168.4.1"

typedef struct {
    wifi_manager_state_t state;
    EventGroupHandle_t event_group;
    SemaphoreHandle_t connection_mutex;
    esp_netif_t *sta_netif;
    esp_netif_t *ap_netif;
    char ssid[33];
    char password[65];
    char ap_ssid[33];
    char ap_password[65];
    bool credentials_saved;
    int reconnect_attempts;
    wifi_ap_record_t ap_info;
    wifi_scan_config_t scan_config;
    uint16_t scan_ap_count;
    wifi_ap_record_t *scan_ap_list;
    bool scan_in_progress;
    bool temporary_apsta_mode;
    bool connection_in_progress;
    uint32_t event_group_operations;
    uint32_t netif_recreation_count;
    void (*state_callback)(wifi_manager_state_t state, void *user_data);
    void *user_data;
} wifi_manager_context_t;

static wifi_manager_context_t s_wifi_manager_ctx = {0};

static esp_err_t recreate_wifi_event_group(wifi_manager_context_t *ctx) {
    EventBits_t current_bits = xEventGroupGetBits(ctx->event_group);
    
    vEventGroupDelete(ctx->event_group);
    ctx->event_group = xEventGroupCreate();
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Failed to recreate WiFi event group");
        return ESP_ERR_NO_MEM;
    }
    
    if (current_bits != 0) {
        xEventGroupSetBits(ctx->event_group, current_bits);
    }
    
    ctx->event_group_operations = 0;
    ESP_LOGI(TAG, "WiFi event group recreated");
    return ESP_OK;
}

static void safe_wifi_set_bits(wifi_manager_context_t *ctx, EventBits_t bits) {
    ctx->event_group_operations++;
    
    if (ctx->event_group_operations >= 1000000) {
        recreate_wifi_event_group(ctx);
    }
    
    xEventGroupSetBits(ctx->event_group, bits);
}

static void safe_wifi_clear_bits(wifi_manager_context_t *ctx, EventBits_t bits) {
    ctx->event_group_operations++;
    
    if (ctx->event_group_operations >= 1000000) {
        recreate_wifi_event_group(ctx);
    }
    
    xEventGroupClearBits(ctx->event_group, bits);
}

static esp_err_t cleanup_and_recreate_netifs(wifi_manager_context_t *ctx) {
    esp_err_t ret = ESP_OK;
    
    if (ctx->sta_netif) {
        esp_netif_destroy(ctx->sta_netif);
        ctx->sta_netif = NULL;
    }
    
    if (ctx->ap_netif) {
        esp_netif_destroy(ctx->ap_netif);
        ctx->ap_netif = NULL;
    }
    
    vTaskDelay(pdMS_TO_TICKS(100));
    
    ctx->sta_netif = esp_netif_create_default_wifi_sta();
    if (ctx->sta_netif == NULL) {
        ESP_LOGE(TAG, "Failed to recreate station netif");
        return ESP_FAIL;
    }
    
    ctx->ap_netif = esp_netif_create_default_wifi_ap();
    if (ctx->ap_netif == NULL) {
        ESP_LOGE(TAG, "Failed to recreate AP netif");
        esp_netif_destroy(ctx->sta_netif);
        ctx->sta_netif = NULL;
        return ESP_FAIL;
    }
    
    return ret;
}

static esp_err_t _internal_wifi_connect_safe(void) {
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->connection_in_progress) {
        ESP_LOGW(TAG, "Connection already in progress, skipping");
        return ESP_ERR_INVALID_STATE;
    }
    
    wifi_mode_t current_mode;
    esp_err_t ret = esp_wifi_get_mode(&current_mode);
    if (ret != ESP_OK) {
        return ret;
    }
    
    if (current_mode == WIFI_MODE_AP) {
        ESP_LOGW(TAG, "Cannot connect in AP-only mode");
        return ESP_ERR_INVALID_STATE;
    }
    
    ctx->connection_in_progress = true;
    
    ret = esp_wifi_connect();
    if (ret == ESP_ERR_WIFI_CONN) {
        ESP_LOGW(TAG, "WiFi connect failed - connection already in progress");
        ctx->connection_in_progress = false;
        return ESP_ERR_INVALID_STATE;
    } else if (ret != ESP_OK) {
        ESP_LOGE(TAG, "WiFi connect failed: %s", esp_err_to_name(ret));
        ctx->connection_in_progress = false;
        return ret;
    }
    
    return ESP_OK;
}

static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (event_base == WIFI_EVENT) {
        switch (event_id) {
            case WIFI_EVENT_SCAN_DONE: {
                wifi_event_sta_scan_done_t *scan_done = (wifi_event_sta_scan_done_t*) event_data;
                ESP_LOGI(TAG, "WiFi scan completed, status: %d, found APs: %u",
                        (int)scan_done->status, (unsigned int)scan_done->number);
                
                ctx->scan_in_progress = false;
                
                if (scan_done->status == 0) {
                    if (ctx->scan_ap_list != NULL) {
                        ctx->scan_ap_list = NULL;
                    }
                    
                    ctx->scan_ap_count = scan_done->number;
                    if (ctx->scan_ap_count > 20) {
                        ctx->scan_ap_count = 20;
                        ESP_LOGW(TAG, "Limiting scan results to 20 APs to preserve memory");
                    }
                    
                    if (ctx->scan_ap_count > 0) {
                        size_t free_heap = esp_get_free_heap_size();
                        
                        if (free_heap > 50000) {
                            static wifi_ap_record_t static_scan_results[20];
                            ctx->scan_ap_list = static_scan_results;
                            
                            esp_err_t get_ret = esp_wifi_scan_get_ap_records(&ctx->scan_ap_count, ctx->scan_ap_list);
                            if (get_ret == ESP_OK) {
                                ESP_LOGI(TAG, "Successfully retrieved %u scan results", ctx->scan_ap_count);
                                
                                for (int i = 0; i < ctx->scan_ap_count - 1; i++) {
                                    for (int j = i + 1; j < ctx->scan_ap_count; j++) {
                                        if (ctx->scan_ap_list[j].rssi > ctx->scan_ap_list[i].rssi) {
                                            wifi_ap_record_t temp = ctx->scan_ap_list[i];
                                            ctx->scan_ap_list[i] = ctx->scan_ap_list[j];
                                            ctx->scan_ap_list[j] = temp;
                                        }
                                    }
                                }
                            } else {
                                ESP_LOGE(TAG, "Failed to get scan records: %s", esp_err_to_name(get_ret));
                                ctx->scan_ap_list = NULL;
                                ctx->scan_ap_count = 0;
                            }
                        } else {
                            ESP_LOGW(TAG, "Insufficient memory for scan results, skipping allocation");
                            ctx->scan_ap_count = 0;
                        }
                    }
                }
                
                if (ctx->temporary_apsta_mode) {
                    ESP_LOGI(TAG, "Reverting to AP mode after scan completion");
                    ctx->temporary_apsta_mode = false;
                    
                    if (!wifi_manager_is_connected()) {
                        esp_err_t mode_ret = esp_wifi_set_mode(WIFI_MODE_AP);
                        if (mode_ret != ESP_OK) {
                            ESP_LOGE(TAG, "Failed to revert to AP mode: %s", esp_err_to_name(mode_ret));
                        }
                    }
                }
                
                safe_wifi_set_bits(ctx, WIFI_SCAN_DONE_BIT);
                break;
            }
            
            case WIFI_EVENT_AP_START:
                ESP_LOGI(TAG, "Access Point started");
                ctx->state = WIFI_MANAGER_STATE_AP_MODE;
                safe_wifi_set_bits(ctx, WIFI_AP_STARTED_BIT);
                if (ctx->state_callback) {
                    ctx->state_callback(ctx->state, ctx->user_data);
                }
                break;
                
            case WIFI_EVENT_AP_STOP:
                ESP_LOGI(TAG, "Access Point stopped");
                safe_wifi_clear_bits(ctx, WIFI_AP_STARTED_BIT);
                break;
            
            default:
                ESP_LOGD(TAG, "Unhandled WiFi event: %d", (int)event_id);
                break;
        }
    } else if (event_base == IP_EVENT) {
        switch (event_id) {
            case IP_EVENT_STA_GOT_IP: {
                ip_event_got_ip_t *event = (ip_event_got_ip_t*) event_data;
                ESP_LOGI(TAG, "Got IP address: " IPSTR, IP2STR(&event->ip_info.ip));
                
                ctx->connection_in_progress = false;
                
                safe_wifi_clear_bits(ctx, WIFI_DISCONNECTED_BIT | WIFI_CONNECT_FAIL_BIT);
                safe_wifi_set_bits(ctx, WIFI_CONNECTED_BIT);
                
                ctx->reconnect_attempts = 0;
                
                if (ctx->state == WIFI_MANAGER_STATE_AP_MODE || 
                    ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
                    ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
                } else {
                    ctx->state = WIFI_MANAGER_STATE_CONNECTED;
                }
                
